# BJTU Smart Grid Course Project
# Economic Dispatch for IEEE 10-generator 39-bus system
using LinearAlgebra

###—————————————————————以下为输入信息，此部分无需修改—————————————————————————
# 发电机有功功率上限向量，下限为0
Pmax = [400 800 800 800 800 800 800 800 1000 1200]
# 发电机成本函数（二次函数）系数，第一、二、三列分别为常数项、一次系数、二次系数
Ccost = [
        400	   10	     0.004
        660	   12	     0.002
        740	   8	     0.005
        720	   9	     0.003
        840	   11	     0.0045
        560	   7	     0.006
        600	   11.5      0.0035
        520	   8.5	     0.0028
        800	   7.5	     0.0052
        450	   10.5      0.0039
]
###————————————————以下为输出信息，本程序输出以下三组变量值—————————————————————
Pout = zeros(10,1) # 发电机输出的有功功率，单位为 MW
Cost_total = 0 # 系统发电总成本，单位为 ￥/hr
MC = zeros(10,1) # 发电机的边际成本，单位为 ￥/MWh
###—————————————————————————————————————————————————————————————————————————



###—————————————请在以下规定区域编写基于等微增率准则的优化调度代码———————————————
# 要求：
# 1. 基于大作业第一部分（潮流分析）中设置的负荷水平开展优化调度
# 2. 输出结果应包括：
# (1) 各发电机组的有功出力 (MW)，存储为10×1的浮点数数组，变量名 Pout
# (2) 系统运行总成本 (￥/hr)，存储为浮点数，变量名 Cost_total
# (3) 各发电机组的边际成本 (￥/MWh)，存储为10×1的浮点数数组，变量名 MC

# ------------------------ 请在下面双引号中填写你的学号 -----------------------
stuID = "17291103"
# ------------- 请在以下空白处编写程序，不要修改其余部分代码及注释 --------------
z1 = [
10
10
10
10
10
10
10
10
10
10
10
]
H = [
0.004 0 0 0 0 0 0 0 0 0 -1
0 0.002 0 0 0 0 0 0 0 0 -1
0 0 0.005 0 0 0 0 0 0 0 -1
0 0 0 0.003 0 0 0 0 0 0 -1
0 0 0 0 0.0045 0 0 0 0 0 -1
0 0 0 0 0 0.006 0 0 0 0 -1
0 0 0 0 0 0 0.0035 0 0 0 -1
0 0 0 0 0 0 0 0.0028 0 0 -1
0 0 0 0 0 0 0 0 0.0052 0 -1
0 0 0 0 0 0 0 0 0 0.0039 -1
1 1 1 1 1 1 1 1 1 1 0
]
z = [
-10
-12
-8
-9
-11
-7
-11.5
-8.5
-7.5
-10.5
6192.88
]
z1 = inv(H)*z
H1 = [
1 0 0 0 0 0 0 0 0 0 0
0 1 0 0 0 0 0 0 0 0 0
0 0 1 0 0 0 0 0 0 0 0
0 0 0 1 0 0 0 0 0 0 0
0 0 0 0 1 0 0 0 0 0 0
0 0 0 0 0 1 0 0 0 0 0
0 0 0 0 0 0 1 0 0 0 0
0 0 0 0 0 0 0 1 0 0 0
0 0 0 0 0 0 0 0 1 0 0
0 0 0 0 0 0 0 0 0 1 0
]
H2 = [
0 0 0 0 0 0 0 0 0 0 1
]
Pout = H1*z1   #提取p30到p39的矩阵
Cost_total = H2*z1 #提取出来等微增率
H3 = [
1 1 1 1 1 1 1 1 1 1
]
H4 = [
1 0 0 0 0 0 0 0 0 0
0 1 0 0 0 0 0 0 0 0
0 0 1 0 0 0 0 0 0 0
0 0 0 1 0 0 0 0 0 0
0 0 0 0 1 0 0 0 0 0
0 0 0 0 0 1 0 0 0 0
0 0 0 0 0 0 1 0 0 0
0 0 0 0 0 0 0 1 0 0
0 0 0 0 0 0 0 0 1 0
0 0 0 0 0 0 0 0 0 1
]
H5 = [
1
1
1
1
1
1
1
1
1
1
]
p1 = Pout*H3*H4 #对角化
p2 = p1*p1*H5 #得到对角化的平方再回带变成10x1矩阵
c1 = [
400
660
740
720
840
560
600
520
800
450
]
c2= [
10
12
8
9
11
7
11.5
8.5
7.5
10.5
]
c3= [
0.004
0.002
0.005
0.003
0.0045
0.006
0.0035
0.0028
0.0052
0.0039
]
MC = c1+(c2*Pout)+(c3*p2)



# ------------- 请在以上空白处编写程序，不要修改其余部分代码及注释 --------------
###—————————————————————————————————————————————————————————————————————————



###————————————————————————————————打印结果——————————————————————————————————
Pout = reshape(Pout,1,10)
MC = reshape(MC,1,10)
println("学号: ", stuID)
println("发电机组的有功出力(MW): ")
println(Pout)
println("系统运行总成本为: ￥", Cost_total, "/hr")
println("发电机组的边际成本(￥/MWh)为: ")
println(MC)
###—————————————————————————————————————————————————————————————————————————
